NTNU-TDT4295/slamdunk/efm32/source/serial.c
#include <stdio.h>
#include "serial.h"

////////////////
// UART
////////////////

// Currently registered UART callback -- it really just prints to the
// LCD for now
void recv_char_cb(char c)
{
	static char str[LCD_BUFFER_SIZE];
	static int idx = 0;

	switch (c) {
	case BACKSPACE:
		if (idx != 0) {
			str[--idx] = 0;
		}
		break;
	case ENTER:
		for (size_t i = 0; i < LCD_BUFFER_SIZE; ++i) {
			str[i] = 0;
			idx = 0;
		}
		break;
	default:
		uartPutChar(c);
		break;
	}

	if ('a' <= c && c <= 'z') {
		str[idx] = c - 32;
		idx = idx == SEGMENT_LCD_NUM_BLOCK_COLUMNS
				  ? SEGMENT_LCD_NUM_BLOCK_COLUMNS
				  : idx + 1;
	}

	SegmentLCD_Write(str);
}

void init_uart()
{
	// LCD for proof of concept, remove later (TODO)
	SegmentLCD_Init(false);

	/* Setup UART for testing */
	set_recv_callback(&recv_char_cb);
	setup_uart();
}

// Mainly for debugging purposes when you want to monitor the pins
void echo_uart()
{
	char rx_data;
	/* Echo RX to TX indefinitely */
	for (;;) {
		rx_data = uartGetChar();
		if (rx_data) {
			uartPutChar(rx_data);
		}
	}
}

////////////////
// I2C
////////////////

void init_i2c(void)
{
	CMU_ClockEnable(cmuClock_I2C0, true);

	// Using default settings
	I2C_Init_TypeDef i2cInit = I2C_INIT_DEFAULT;

	/* Using PD6 (SDA) and PD7 (SCL) */
	GPIO_PinModeSet(gpioPortD, 7, gpioModeWiredAndPullUpFilter, 1);
	GPIO_PinModeSet(gpioPortD, 6, gpioModeWiredAndPullUpFilter, 1);

	// Setting up PC0 to indicate transfer direction
	GPIO_PinModeSet(gpioPortC, 0, gpioModePushPull, 0);

	/* Enable pins at location 1 */
	I2C0->ROUTE = I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN | (1 << _I2C_ROUTE_LOCATION_SHIFT);

	/* Initializing the I2C */
	I2C_Init(I2C0, &i2cInit);
}

// NOTE: the address of the register must be the first byte *buf (this
// is super stupid, TODO me)
void performI2CTransfer(uint8_t addr, uint8_t* buf, uint8_t bytes)
{
	/* Transfer structure */
	I2C_TransferSeq_TypeDef i2cTransfer;

	/* Setting pin to indicate transfer */
	GPIO_PinOutSet(gpioPortC, 0);

	/* Initializing I2C transfer */
	i2cTransfer.addr = addr;
	i2cTransfer.flags = I2C_FLAG_WRITE;

	i2cTransfer.buf[0].data = buf;
	i2cTransfer.buf[0].len = bytes;

	// Initialize the transfer and wait for completion
	I2C_TransferInit(I2C0, &i2cTransfer);
	while (I2C_Transfer(I2C0) == i2cTransferInProgress) {
		;
	}

	/* Clearing pin to indicate end of transfer */
	GPIO_PinOutClear(gpioPortC, 0);
}

void performI2CRead(uint8_t addr, int8_t reg, uint8_t* buf, uint8_t bytes)
{
	/* Transfer structure */
	I2C_TransferSeq_TypeDef i2cTransfer;

	uint8_t regid[1] = {reg};

	// EULER data registers
	// 0x1A to 0x1F, 0x1A is LSB 0x1B is MSB of 16-bit value

	/* Setting pin to indicate transfer */
	GPIO_PinOutSet(gpioPortC, 0);

	/* Initializing I2C transfer */
	i2cTransfer.addr = addr;
	i2cTransfer.flags = I2C_FLAG_WRITE_READ;

	i2cTransfer.buf[0].data = regid;
	i2cTransfer.buf[0].len = 1;

	i2cTransfer.buf[1].data = buf;
	i2cTransfer.buf[1].len = bytes;

	// Initialize a transfer and wait for completion, note that no
	// error handling/reporting is done (TODO)
	I2C_TransferInit(I2C0, &i2cTransfer);
	while (I2C_Transfer(I2C0) == i2cTransferInProgress) {
		;
	}

	/* Clearing pin to indicate end of transfer */
	GPIO_PinOutClear(gpioPortC, 0);
}

void I2C0_IRQHandler(void)
{
	;
}


//////////////////////


#include "em_device.h"

void SPI_setup(uint8_t spiNumber, uint8_t location, bool master);
void SPI2_setupRXInt(char* receiveBuffer, int bytesToReceive);
void SPI1_setupSlaveInt(char* receiveBuffer, int receiveBufferSize, char* transmitBuffer, int transmitBufferSize);


#define HFRCO_FREQUENCY 14000000
#define SPI_PERCLK_FREQUENCY HFRCO_FREQUENCY
#define SPI_BAUDRATE 1000000

/* Buffer pointers and indexes */
char* slaveTxBuffer;
int slaveTxBufferSize;
volatile int slaveTxBufferIndex;
char* slaveRxBuffer;
int slaveRxBufferSize;
volatile int slaveRxBufferIndex;
char* masterRxBuffer;
int masterRxBufferSize;
volatile int masterRxBufferIndex;


/**************************************************************************/ /**
 * @brief Setup a USART as SPI
 * @param spiNumber is the number of the USART to use (e.g. 1 USART1)
 * @param location is the GPIO location to use for the device
 * @param master set if the SPI is to be master
 *****************************************************************************/
void SPI_setup(uint8_t spiNumber, uint8_t location, bool master)
{
	USART_TypeDef* spi;

	/* Determining USART */
	switch (spiNumber) {
	case 0:
		spi = USART0;
		break;
	case 1:
		spi = USART1;
		break;
	/* case 2: */
	/* 	spi = USART2; */
	/* 	break; */
	default:
		return;
	}

	/* Setting baudrate */
	spi->CLKDIV = 128 * (SPI_PERCLK_FREQUENCY / SPI_BAUDRATE - 2);

	/* Configure SPI */
	/* Using synchronous (SPI) mode*/
	spi->CTRL = USART_CTRL_SYNC;
	/* Clearing old transfers/receptions, and disabling interrupts */
	spi->CMD = USART_CMD_CLEARRX | USART_CMD_CLEARTX;
	spi->IEN = 0;
	/* Enabling pins and setting location */
	spi->ROUTE = USART_ROUTE_TXPEN | USART_ROUTE_RXPEN | USART_ROUTE_CLKPEN | USART_ROUTE_CSPEN | (location << 8);

	/* Set GPIO config to slave */
	GPIO_Mode_TypeDef gpioModeMosi = gpioModeInput;
	GPIO_Mode_TypeDef gpioModeMiso = gpioModePushPull;
	GPIO_Mode_TypeDef gpioModeCs = gpioModeInput;
	GPIO_Mode_TypeDef gpioModeClk = gpioModeInput;

	/* Set to master and to control the CS line */
	if (master) {
		/* Enabling Master, TX and RX */
		spi->CMD = USART_CMD_MASTEREN | USART_CMD_TXEN | USART_CMD_RXEN;
		spi->CTRL |= USART_CTRL_AUTOCS;

		/* Set GPIO config to master */
		gpioModeMosi = gpioModePushPull;
		gpioModeMiso = gpioModeInput;
		gpioModeCs = gpioModePushPull;
		gpioModeClk = gpioModePushPull;
	} else {
		/* Enabling TX and RX */
		spi->CMD = USART_CMD_TXEN | USART_CMD_RXEN;
	}

	/* Clear previous interrupts */
	spi->IFC = _USART_IFC_MASK;

	/* IO configuration */
	switch (spiNumber) {
	case 0:
		switch (location) {
		case 0:												 /* IO configuration (USART 0, Location #0) */
			GPIO_PinModeSet(gpioPortE, 10, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortE, 11, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortE, 13, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortE, 12, gpioModeClk, 0);  /* Clock */
			break;
		case 1:												/* IO configuration (USART 0, Location #1) */
			GPIO_PinModeSet(gpioPortE, 7, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortE, 6, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortE, 4, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortE, 5, gpioModeClk, 0);  /* Clock */
			break;
		case 2:												 /* IO configuration (USART 0, Location #2) */
			GPIO_PinModeSet(gpioPortC, 11, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortC, 10, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortC, 8, gpioModeCs, 0);	/* CS */
			GPIO_PinModeSet(gpioPortC, 9, gpioModeClk, 0);   /* Clock */
			break;
		default:
			break;
		}
		break;
	case 1:
		switch (location) {
		case 0:												/* IO configuration (USART 1, Location #0) */
			GPIO_PinModeSet(gpioPortC, 0, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortC, 1, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortB, 8, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortB, 7, gpioModeClk, 0);  /* Clock */
			break;
		case 1:												/* IO configuration (USART 1, Location #1) */
			GPIO_PinModeSet(gpioPortD, 0, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortD, 1, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortD, 3, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortD, 2, gpioModeClk, 0);  /* Clock */
			break;
		default:
			break;
		}
		break;
	case 2:
		switch (location) {
		case 0:												/* IO configuration (USART 2, Location #0) */
			GPIO_PinModeSet(gpioPortC, 2, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortC, 3, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortC, 5, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortC, 4, gpioModeClk, 0);  /* Clock */
			break;
		case 1:												/* IO configuration (USART 2, Location #1) */
			GPIO_PinModeSet(gpioPortB, 3, gpioModeMosi, 0); /* MOSI */
			GPIO_PinModeSet(gpioPortB, 4, gpioModeMiso, 0); /* MISO */
			GPIO_PinModeSet(gpioPortB, 6, gpioModeCs, 0);   /* CS */
			GPIO_PinModeSet(gpioPortB, 5, gpioModeClk, 0);  /* Clock */
			break;
		default:
			break;
		}
		break;
	default:
		break;
	}
}


/**************************************************************************/ /**
 * @brief USART1 RX IRQ Handler Setup
 * @param receiveBuffer points to where to place recieved data
 * @param receiveBufferSize indicates the number of bytes to receive
 *****************************************************************************/
void SPI1_setupRXInt(char* receiveBuffer, int receiveBufferSize)
{
	USART_TypeDef* spi = USART1;

	/* Setting up pointer and indexes */
	slaveRxBuffer = receiveBuffer;
	slaveRxBufferSize = receiveBufferSize;
	slaveRxBufferIndex = 0;

	/* Clear RX */
	spi->CMD = USART_CMD_CLEARRX;

	/* Enable interrupts */
	NVIC_ClearPendingIRQ(USART1_RX_IRQn);
	NVIC_EnableIRQ(USART1_RX_IRQn);
	spi->IEN |= USART_IEN_RXDATAV;
}


/**************************************************************************/ /**
 * @brief USART1 TX IRQ Handler Setup
 * @param transmitBuffer points to the data to send
 * @param transmitBufferSize indicates the number of bytes to send
 *****************************************************************************/
void SPI1_setupTXInt(char* transmitBuffer, int transmitBufferSize)
{
	USART_TypeDef* spi = USART1;

	/* Setting up pointer and indexes */
	slaveTxBuffer = transmitBuffer;
	slaveTxBufferSize = transmitBufferSize;
	slaveTxBufferIndex = 0;

	/* Clear TX */
	spi->CMD = USART_CMD_CLEARTX;

	/* Enable interrupts */
	NVIC_ClearPendingIRQ(USART1_TX_IRQn);
	NVIC_EnableIRQ(USART1_TX_IRQn);
	spi->IEN |= USART_IEN_TXBL;
}


/**************************************************************************/ /**
 * @brief Setting up RX interrupts from USART2 RX
 * @param receiveBuffer points to where received data is to be stored
 * @param bytesToReceive indicates the number of bytes to receive
 *****************************************************************************/
/* void SPI2_setupRXInt(char* receiveBuffer, int bytesToReceive) */
/* { */
/* 	USART_TypeDef* spi = USART2; */

/* 	/\* Setting up pointer and indexes *\/ */
/* 	masterRxBuffer = receiveBuffer; */
/* 	masterRxBufferSize = bytesToReceive; */
/* 	masterRxBufferIndex = 0; */

/* 	/\* Flushing rx *\/ */
/* 	spi->CMD = USART_CMD_CLEARRX; */

/* 	/\* Enable interrupts *\/ */
/* 	NVIC_ClearPendingIRQ(USART2_RX_IRQn); */
/* 	NVIC_EnableIRQ(USART2_RX_IRQn); */
/* 	spi->IEN = USART_IEN_RXDATAV; */
/* } */


/**************************************************************************/ /**
 * @brief USART1 IRQ Handler Setup
 * @param receiveBuffer points to where received data is to be stored
 * @param receiveBufferSize indicates the number of bytes to receive
 * @param transmitBuffer points to the data to send
 * @param transmitBufferSize indicates the number of bytes to send
 *****************************************************************************/
void SPI1_setupSlaveInt(char* receiveBuffer, int receiveBufferSize, char* transmitBuffer, int transmitBufferSize)
{
	SPI1_setupRXInt(receiveBuffer, receiveBufferSize);
	SPI1_setupTXInt(transmitBuffer, transmitBufferSize);
}


/**************************************************************************/ /**
 * @brief USART1 RX IRQ Handler
 *****************************************************************************/
void USART1_RX_IRQHandler(void)
{
	USART_TypeDef* spi = USART1;
	uint8_t rxdata;

	if (spi->STATUS & USART_STATUS_RXDATAV) {
		/* Reading out data */
		rxdata = spi->RXDATA;

		if (slaveRxBufferIndex < slaveRxBufferSize) {
			/* Store Data */
			slaveRxBuffer[slaveRxBufferIndex] = rxdata;
			slaveRxBufferIndex++;
		}
	}
}


/**************************************************************************/ /**
 * @brief USART1 TX IRQ Handler
 *****************************************************************************/
void USART1_TX_IRQHandler(void)
{
	USART_TypeDef* spi = USART1;

	if (spi->STATUS & USART_STATUS_TXBL) {
		/* Checking that valid data is to be transferred */
		if (slaveTxBuffer != 0) {
			/* Writing new data */
			spi->TXDATA = slaveTxBuffer[slaveTxBufferIndex];
			slaveTxBufferIndex++;
			/*Checking if more data is to be transferred */
			if (slaveTxBufferIndex == slaveTxBufferSize) {
				slaveTxBuffer = 0;
			}
		} else {
			/* Sending 0 if no data to send */
			spi->TXDATA = 0;
		}
	}
}


/**************************************************************************/ /**
 * @brief USART2 RX IRQ Handler
 *****************************************************************************/
/* void USART2_RX_IRQHandler(void) */
/* { */
/* 	USART_TypeDef* spi = USART2; */
/* 	uint8_t rxdata; */

/* 	if (spi->STATUS & USART_STATUS_RXDATAV) { */
/* 		/\* Reading out data *\/ */
/* 		rxdata = spi->RXDATA; */

/* 		if (masterRxBuffer != 0) { */
/* 			/\* Store Data *\/ */
/* 			masterRxBuffer[masterRxBufferIndex] = rxdata; */
/* 			masterRxBufferIndex++; */

/* 			if (masterRxBufferIndex == masterRxBufferSize) { */
/* 				masterRxBuffer = 0; */
/* 			} */
/* 		} */
/* 	} */
/* } */



/******************************************************************************
 * @brief sends data using USART1
 * @param txBuffer points to data to transmit
 * @param bytesToSend bytes will be sent
 *****************************************************************************/
void USART1_sendBuffer(char* txBuffer, int bytesToSend)
{
	USART_TypeDef* uart = USART1;
	int ii;

	/* Sending the data */
	for (ii = 0; ii < bytesToSend; ii++) {
		/* Waiting for the usart to be ready */
		while (!(uart->STATUS & USART_STATUS_TXBL))
			;

		if (txBuffer != 0) {
			/* Writing next byte to USART */
			uart->TXDATA = *txBuffer;
			txBuffer++;
		} else {
			uart->TXDATA = 0;
		}
	}

	/*Waiting for transmission of last byte */
	while (!(uart->STATUS & USART_STATUS_TXC))
		;
}
